{
  "hunting": [
    {
      "author": "thomas couilleaux",
      "displayName": "HuntingRule01",
      "reference": "https://medium.com/falconforce/falconfriday-detecting-certutil-and-suspicious-code-compilation-0xff02-cfe8fb5e159e?source=friends_link&sk=3c63b684a2f6a203d8627554cec9a628",
      "description": "test",
      "query": "SecurityEvent | where EventID == \"4687\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Persistence",
        "LateralMovement",
        "Collection"
      ]
    },
    {
      "author": "thomas couilleaux",
      "displayName": "HuntingRule02",
      "reference": "https://medium.com/falconforce/falconfriday-detecting-certutil-and-suspicious-code-compilation-0xff02-cfe8fb5e159e?source=friends_link&sk=3c63b684a2f6a203d8627554cec9a628",
      "description": "test",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Persistence",
        "LateralMovement"
      ]
    }
  ]
}