{
  "hunting": [
    {
      "author": "wortell",
      "displayName": "KQL_apt_apt29_thinktanks",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_apt29_thinktanks.txt",
      "description": "KQL_apt_apt29_thinktanks",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_babyshark",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_babyshark.txt",
      "description": "KQL_apt_babyshark",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine == \"reg query \"HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Default\"\" or CommandLine startswith \"powershell.exe mshta.exe http\" or CommandLine == \"cmd.exe /c taskkill /im cmd.exe\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_bear_activity_gtr19",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_bear_activity_gtr19.txt",
      "description": "KQL_apt_bear_activity_gtr19",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\xcopy.exe\" and CommandLine contains \" /S /E /C /Q /H \\\\\") or (Image endswith \"\\\\adexplorer.exe\" and CommandLine contains \" -snapshot \\\"\\\" c:\\\\users\\\\\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_cloudhopper",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_cloudhopper.txt",
      "description": "KQL_apt_cloudhopper",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Image endswith \"\\\\cscript.exe\" and CommandLine contains \".vbs /shell \")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_dragonfly",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_dragonfly.txt",
      "description": "KQL_apt_dragonfly",
      "query": "SecurityEvent | where EventID == \"4688\" | where Image endswith \"\\\\crackmapexec.exe\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_elise",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_elise.txt",
      "description": "KQL_apt_elise",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image == \"C:\\Windows\\SysWOW64\\cmd.exe\" and CommandLine contains \"\\\\Windows\\\\Caches\\\\NavShExt.dll \") or CommandLine endswith \"\\\\AppData\\\\Roaming\\\\MICROS~1\\\\Windows\\\\Caches\\\\NavShExt.dll,Setting\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_empiremonkey",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_empiremonkey.txt",
      "description": "KQL_apt_empiremonkey",
      "query": "SecurityEvent | where EventID == \"4688\" | where (CommandLine endswith \"/i:%APPDATA%\\\\logs.txt scrobj.dll\" and (Image endswith \"\\\\cutil.exe\" or Description == \"Microsoft(C) Registerserver\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_equationgroup_dll_u_load",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_equationgroup_dll_u_load.txt",
      "description": "KQL_apt_equationgroup_dll_u_load",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\rundll32.exe\" and CommandLine endswith \",dll_u\") or CommandLine contains \" -export dll_u \")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_hurricane_panda",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_hurricane_panda.txt",
      "description": "KQL_apt_hurricane_panda",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine endswith \" localgroup administrators admin /add\" or CommandLine contains \"\\\\Win64.exe\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_judgement_panda_gtr19",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_judgement_panda_gtr19.txt",
      "description": "KQL_apt_judgement_panda_gtr19",
      "query": "SecurityEvent | where EventID == \"4688\" | where (CommandLine contains \"\\\\ldifde.exe -f -n \" or CommandLine contains \"\\\\7za.exe a 1.7z \" or CommandLine endswith \" eprod.ldf\" or CommandLine contains \"\\\\aaaa\\\\procdump64.exe\" or CommandLine contains \"\\\\aaaa\\\\netsess.exe\" or CommandLine contains \"\\\\aaaa\\\\7za.exe\" or CommandLine contains \"copy .\\\\1.7z \\\\\" or CommandLine contains \"copy \\\\client\\\\c$\\\\aaaa\\\\\" or Image == \"C:\\Users\\Public\\7za.exe\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_pandemic",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_pandemic.txt",
      "description": "KQL_apt_pandemic",
      "query": "Event | where (EventID == \"13\" and TargetObject startswith \"\\\\REGISTRY\\\\MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\services\\\\null\\\\Instance\" or TargetObject startswith \"\\\\REGISTRY\\\\MACHINE\\\\SYSTEM\\\\ControlSet001\\\\services\\\\null\\\\Instance\" or TargetObject startswith \"\\\\REGISTRY\\\\MACHINE\\\\SYSTEM\\\\ControlSet002\\\\services\\\\null\\\\Instance\") SecurityEvent | where EventID == \"4688\" | where Command startswith \"loaddll -a \"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_slingshot",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_slingshot.txt",
      "description": "KQL_apt_slingshot",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine matches regex \".*schtasks.* /delete .*Defrag\\\\ScheduledDefrag.*\" SecurityEvent | where (EventID == \"4701\" and TaskName == \"\\Microsoft\\Windows\\Defrag\\ScheduledDefrag\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_sofacy_zebrocy",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_sofacy_zebrocy.txt",
      "description": "KQL_apt_sofacy_zebrocy",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine endswith \"cmd.exe /c SYSTEMINFO & TASKLIST\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_sofacy",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_sofacy.txt",
      "description": "KQL_apt_sofacy",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine matches regex \"rundll32\\.exe %APPDATA%\\\\\\.*\\.dat\\\",.*\" or CommandLine matches regex \"rundll32\\.exe %APPDATA%\\\\\\.*\\.dll\\\",#1\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_ta17_293a_ps",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_ta17_293a_ps.txt",
      "description": "KQL_apt_ta17_293a_ps",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine == \"ps.exe -accepteula\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_tropictrooper",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_tropictrooper.txt",
      "description": "KQL_apt_tropictrooper",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"abCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCc\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_turla_namedpipes",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_turla_namedpipes.txt",
      "description": "KQL_apt_turla_namedpipes",
      "query": "Event | where (EventID == \"17\" or EventID == \"18\" and PipeName == \"\\atctl\" or PipeName == \"\\userpipe\" or PipeName == \"\\iehelper\" or PipeName == \"\\sdlrpc\" or PipeName == \"\\comnap\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_unidentified_nov_18",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_unidentified_nov_18.txt",
      "description": "KQL_apt_unidentified_nov_18",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine endswith \"cyzfc.dat, PointFunctionCall\" Event | where (EventID == \"11\" and TargetFilename contains \"ds7002.lnk\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_apt_zxshell",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_apt_zxshell.txt",
      "description": "KQL_apt_zxshell",
      "query": "SecurityEvent | where EventID == \"4688\" | where Command matches regex \"rundll32\\.exe .*,zxFunction.*\" or Command matches regex \"rundll32\\.exe .*,RemoteDiskXXXXX\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_crime_fireball",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_crime_fireball.txt",
      "description": "KQL_crime_fireball",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine matches regex \".*\\\\rundll32\\.exe .*,InstallArcherSvc\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_powershell_xor_commandline",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_powershell_xor_commandline.txt",
      "description": "KQL_powershell_xor_commandline",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \" -bxor\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_sysmon_susp_rdp",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_sysmon_susp_rdp.txt",
      "description": "KQL_sysmon_susp_rdp",
      "query": "// title: Suspicious Outbound RDP Connections  // description: Detects Non-Standard Tools Connecting to TCP port 3389 indicating possible lateral movement // // reference: https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708 // // original author: Markus Neis (Swisscom) // KQL author: Maarten Goet (condicio) // // MITRE ATT&CK: lateral_movement, t1210   Event  | parse EventData with    * Data Name=\"RuleName\"> RuleName <    * Data Name=\"UtcTime\"> UtcTime <    * Data Name=\"ProcessGuid\"> ProcessGuid <    * Data Name=\"ProcessId\"> ProcessId <    * Data Name=\"Image\"> Image <    * Data Name=\"User\"> User <    * Data Name=\"Protocol\"> Protocol <    * Data Name=\"Initiated\"> Initiated <    * Data Name=\"SourceIsIpv6\"> SourceIsIpv6 <    * Data Name=\"SourceIp\"> SourceIp <    * Data Name=\"SourceHostname\"> SourceHostname <    * Data Name=\"SourcePort\"> SourcePort <    * Data Name=\"SourcePortName\"> SourcePortName <    * Data Name=\"DestinationIsIpv6\"> DestinationIsIpv6 <    * Data Name=\"DestinationIp\"> DestinationIp <    * Data Name=\"DestinationHostname\"> DestinationHostname <    * Data Name=\"DestinationPort\"> DestinationPort <    * Data Name=\"DestinationPortName\"> DestinationPortName <    *    | where ((EventID == \"3\" and DestinationPort == \"3389\") and not     (Image endswith \"\\\\mstsc.exe\"   or Image endswith \"\\\\RTSApp.exe\"   or Image endswith \"\\\\RTS2App.exe\"   or Image endswith \"\\\\RDCMan.exe\"   or Image endswith \"\\\\ws_TunnelService.exe\"   or Image endswith \"\\\\RSSensor.exe\"   or Image endswith \"\\\\RemoteDesktopManagerFree.exe\"   or Image endswith \"\\\\RemoteDesktopManager.exe\"   or Image endswith \"\\\\RemoteDesktopManager64.exe\"   or Image endswith \"\\\\mRemoteNG.exe\"   or Image endswith \"\\\\mRemote.exe\"   or Image endswith \"\\\\Terminals.exe\"   or Image endswith \"\\\\spiceworks-finder.exe\"   or Image endswith \"\\\\FSDiscovery.exe\"   or Image endswith \"\\\\FSAssessment.exe\"   or Image endswith \"\\\\MobaRTE.exe\"   or Image endswith \"\\\\chrome.exe\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_account_backdoor_dcsync_rights",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_account_backdoor_dcsync_rights.txt",
      "description": "KQL_win_account_backdoor_dcsync_rights",
      "query": "SecurityEvent | where (EventID == \"5136\" and LDAPDisplayName == \"ntSecurityDescriptor\" and Value contains \"1131f6ad-9c07-11d1-f79f-00c04fc2dcd2\" or Value contains \"1131f6aa-9c07-11d1-f79f-00c04fc2dcd2\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_account_discovery",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_account_discovery.txt",
      "description": "KQL_win_account_discovery",
      "query": "SecurityEvent | where (EventID == \"4661\" and ObjectType == \"SAM_USER\" or ObjectType == \"SAM_GROUP\" and ObjectName endswith \"-512\" or ObjectName endswith \"-502\" or ObjectName endswith \"-500\" or ObjectName endswith \"-505\" or ObjectName endswith \"-519\" or ObjectName endswith \"-520\" or ObjectName endswith \"-544\" or ObjectName endswith \"-551\" or ObjectName endswith \"-555\" or ObjectName contains \"admin\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_admin_rdp_login",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_admin_rdp_login.txt",
      "description": "KQL_win_admin_rdp_login",
      "query": "SecurityEvent | where (EventID == \"4624\" and LogonType == \"10\" and AuthenticationPackageName == \"Negotiate\" and AccountName startswith \"Admin-\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_admin_share_access",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_admin_share_access.txt",
      "description": "KQL_win_admin_share_access",
      "query": "SecurityEvent | where ((EventID == \"5140\" and ShareName == \"Admin$\") and not (SubjectUserName endswith \"$\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_alert_active_directory_user_control",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_alert_active_directory_user_control.txt",
      "description": "KQL_win_alert_active_directory_user_control",
      "query": "SecurityEvent | where (EventID == \"4704\" and \"SeEnableDelegationPrivilege\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_alert_ad_user_backdoors",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_alert_ad_user_backdoors.txt",
      "description": "KQL_win_alert_ad_user_backdoors",
      "query": "SecurityEvent | where ((((EventID == \"4738\" and not (isnull(AllowedToDelegateTo))) or (EventID == \"5136\" and AttributeLDAPDisplayName == \"msDS-AllowedToDelegateTo\")) or (EventID == \"5136\" and ObjectClass == \"user\" and AttributeLDAPDisplayName == \"servicePrincipalName\")) or (EventID == \"5136\" and AttributeLDAPDisplayName == \"msDS-AllowedToActOnBehalfOfOtherIdentity\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_alert_enable_weak_encryption",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_alert_enable_weak_encryption.txt",
      "description": "KQL_win_alert_enable_weak_encryption",
      "query": "SecurityEvent | where ((EventID == \"4738\" and (\"DES\" or \"Preauth\" or \"Encrypted\")) and \"Enabled\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_alert_hacktool_use",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_alert_hacktool_use.txt",
      "description": "KQL_win_alert_hacktool_use",
      "query": "SecurityEvent | where (EventID == \"4776\" or EventID == \"4624\" or EventID == \"4625\" and WorkstationName == \"RULER\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_atsvc_task",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_atsvc_task.txt",
      "description": "KQL_win_atsvc_task",
      "query": "SecurityEvent | where (EventID == \"5145\" and ShareName matches regex \"\\\\\\.*\\\\IPC\\$\" and RelativeTargetName == \"atsvc\" and Accesses contains \"WriteData\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_attrib_hiding_files",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_attrib_hiding_files.txt",
      "description": "KQL_win_attrib_hiding_files",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\attrib.exe\" and CommandLine contains \" +h \") and not ((CommandLine contains \"\\\\desktop.ini \" or (ParentImage endswith \"\\\\cmd.exe\" and CommandLine matches regex \"+R +H +S +A \\\\\\.*\\.cui\" and ParentCommandLine matches regex \"C:\\\\WINDOWS\\\\system32\\\\\\.*\\.bat\"))))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_bypass_squiblytwo",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_bypass_squiblytwo.txt",
      "description": "KQL_win_bypass_squiblytwo",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\wmic.exe\" and CommandLine matches regex \"wmic .* .*format:\\\\\\\"http.*\" or CommandLine matches regex \"wmic .* /format:http\" or CommandLine matches regex \"wmic .* /format:http.*\") or (Imphash == \"1B1A3F43BF37B5BFE60751F2EE2F326E\" or Imphash == \"37777A96245A3C74EB217308F3546F4C\" or Imphash == \"9D87C9D67CE724033C0B40CC4CA1B206\" and CommandLine matches regex \".* .*format:\\\\\\\"http.*\" or CommandLine endswith \" /format:http\" or CommandLine contains \" /format:http\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_cmdkey_recon",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_cmdkey_recon.txt",
      "description": "KQL_win_cmdkey_recon",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Image endswith \"\\\\cmdkey.exe\" and CommandLine contains \" /list \")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_cmstp_com_object_access",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_cmstp_com_object_access.txt",
      "description": "KQL_win_cmstp_com_object_access",
      "query": "SecurityEvent | where EventID == \"4688\" | where (ParentCommandLine endswith \"\\\\DllHost.exe\" and ParentCommandLine endswith \"\\\\{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ParentCommandLine endswith \"\\\\{3E000D72-A845-4CD9-BD83-80C07C3B881F}\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_dcsync",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_dcsync.txt",
      "description": "KQL_win_dcsync",
      "query": "SecurityEvent | where (EventID == \"4662\" and Properties contains \"Replicating Directory Changes All\" or Properties contains \"1131f6ad-9c07-11d1-f79f-00c04fc2dcd2\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_disable_event_logging",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_disable_event_logging.txt",
      "description": "KQL_win_disable_event_logging",
      "query": "SecurityEvent | where (EventID == \"4719\" and AuditPolicyChanges == \"removed\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_exploit_cve_2015_1641",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_exploit_cve_2015_1641.txt",
      "description": "KQL_win_exploit_cve_2015_1641",
      "query": "SecurityEvent | where EventID == \"4688\" | where (ParentImage endswith \"\\\\WINWORD.EXE\" and Image endswith \"\\\\MicroScMgmt.exe \")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_exploit_cve_2017_0261",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_exploit_cve_2017_0261.txt",
      "description": "KQL_win_exploit_cve_2017_0261",
      "query": "SecurityEvent | where EventID == \"4688\" | where (ParentImage endswith \"\\\\WINWORD.EXE\" and Image contains \"\\\\FLTLDR.exe\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_exploit_cve_2017_11882",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_exploit_cve_2017_11882.txt",
      "description": "KQL_win_exploit_cve_2017_11882",
      "query": "SecurityEvent | where EventID == \"4688\" | where ParentImage endswith \"\\\\EQNEDT32.EXE\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_exploit_cve_2017_8759",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_exploit_cve_2017_8759.txt",
      "description": "KQL_win_exploit_cve_2017_8759",
      "query": "SecurityEvent | where EventID == \"4688\" | where (ParentImage endswith \"\\\\WINWORD.EXE\" and Image endswith \"\\\\csc.exe\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_GPO_scheduledtasks",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_GPO_scheduledtasks.txt",
      "description": "KQL_win_GPO_scheduledtasks",
      "query": "SecurityEvent | where (EventID == \"5145\" and ShareName matches regex \"\\\\\\.*\\\\SYSVOL\" and RelativeTargetName endswith \"ScheduledTasks.xml\" and Accesses contains \"WriteData\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_hack_rubeus",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_hack_rubeus.txt",
      "description": "KQL_win_hack_rubeus",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \" asreproast \" or CommandLine contains \" dump /service:krbtgt \" or CommandLine contains \" kerberoast \" or CommandLine contains \" createnetonly /program:\" or CommandLine contains \" ptt /ticket:\" or CommandLine contains \" /impersonateuser:\" or CommandLine contains \" renew /ticket:\" or CommandLine contains \" asktgt /user:\" or CommandLine contains \" harvest /interval:\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_impacket_secretdump",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_impacket_secretdump.txt",
      "description": "KQL_win_impacket_secretdump",
      "query": "SecurityEvent | where (EventID == \"5145\" and ShareName matches regex \"\\\\\\.*\\\\ADMIN\\$\" and RelativeTargetName matches regex \"SYSTEM32\\.*\\.tmp\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_lethalhta",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_lethalhta.txt",
      "description": "KQL_win_lethalhta",
      "query": "SecurityEvent | where EventID == \"4688\" | where (ParentImage endswith \"\\\\svchost.exe\" and Image endswith \"\\\\mshta.exe\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_lm_namedpipe",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_lm_namedpipe.txt",
      "description": "KQL_win_lm_namedpipe",
      "query": "SecurityEvent | where ((EventID == \"5145\" and ShareName matches regex \"\\\\\\.*\\\\IPC\\$\") and not (EventID == \"5145\" and ShareName matches regex \"\\\\\\.*\\\\IPC\\$\" and RelativeTargetName == \"atsvc\" or RelativeTargetName == \"samr\" or RelativeTargetName == \"lsarpc\" or RelativeTargetName == \"winreg\" or RelativeTargetName == \"netlogon\" or RelativeTargetName == \"srvsvc\" or RelativeTargetName == \"protected_storage\" or RelativeTargetName == \"wkssvc\" or RelativeTargetName == \"browser\" or RelativeTargetName == \"netdfs\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mal_adwind",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mal_adwind.txt",
      "description": "KQL_win_mal_adwind",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine matches regex \".*\\\\AppData\\\\Roaming\\\\Oracle.*\\\\java.*\\.exe .*\" or CommandLine matches regex \".*cscript\\.exe .*Retrive.*\\.vbs .*\" Event | where (EventID == \"11\" and TargetFilename matches regex \".*\\\\AppData\\\\Roaming\\\\Oracle\\\\bin\\\\java.*\\.exe\" or TargetFilename matches regex \".*\\\\Retrive.*\\.vbs\") Event | where (EventID == \"13\" and TargetObject startswith \"\\\\REGISTRY\\\\MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" and Details startswith \"%AppData%\\\\Roaming\\\\Oracle\\\\bin\\\\\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mal_lockergoga",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mal_lockergoga.txt",
      "description": "KQL_win_mal_lockergoga",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine endswith \" cl Microsoft-Windows-WMI-Activity/Trace\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mal_ursnif",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mal_ursnif.txt",
      "description": "KQL_win_mal_ursnif",
      "query": "Event | where (EventID == \"13\" and TargetObject startswith \"HKU\\\\Software\\\\AppDataLow\\\\Software\\\\Microsoft\\\\\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mal_wannacry",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mal_wannacry.txt",
      "description": "KQL_win_mal_wannacry",
      "query": "SecurityEvent | where EventID == \"4688\" | where (CommandLine contains \"vssadmin delete shadows\" or CommandLine matches regex \".*icacls .* /grant Everyone:F /T /C /Q.*\" or CommandLine contains \"bcdedit /set {default} recoveryenabled no\" or CommandLine contains \"wbadmin delete catalog -quiet\" or Image endswith \"\\\\tasksche.exe\" or Image endswith \"\\\\mssecsvc.exe\" or Image endswith \"\\\\taskdl.exe\" or Image contains \"\\\\WanaDecryptor\" or Image endswith \"\\\\taskhsvc.exe\" or Image endswith \"\\\\taskse.exe\" or Image endswith \"\\\\111.exe\" or Image endswith \"\\\\lhdfrgui.exe\" or Image endswith \"\\\\diskpart.exe\" or Image endswith \"\\\\linuxnew.exe\" or Image endswith \"\\\\wannacry.exe\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mal_wceaux_dll",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mal_wceaux_dll.txt",
      "description": "KQL_win_mal_wceaux_dll",
      "query": "SecurityEvent | where (EventID == \"4656\" or EventID == \"4658\" or EventID == \"4660\" or EventID == \"4663\" and ObjectName endswith \"\\\\wceaux.dll\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_malware_dridex",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_malware_dridex.txt",
      "description": "KQL_win_malware_dridex",
      "query": "SecurityEvent | where EventID == \"4688\" | where (CommandLine matches regex \".*\\\\svchost\\.exe C:\\\\Users\\\\\\.*\\\\Desktop\\\\\\.*\" or (ParentImage contains \"\\\\svchost.exe\" and CommandLine endswith \"whoami.exe /all\" or CommandLine endswith \"net.exe view\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_malware_notpetya",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_malware_notpetya.txt",
      "description": "KQL_win_malware_notpetya",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\fsutil.exe\" and CommandLine contains \" deletejournal \") or CommandLine matches regex \".*\\\\AppData\\\\Local\\\\Temp\\.* \\\\\\\\\\.\\\\pipe\\\\\\.*\" or (Image endswith \"\\\\wevtutil.exe\" and CommandLine contains \" cl \") or (Image endswith \"\\\\rundll32.exe\" and CommandLine endswith \".dat,#1\") or \"*\\\\perfc.dat*\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_malware_script_dropper",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_malware_script_dropper.txt",
      "description": "KQL_win_malware_script_dropper",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\wscript.exe\" or Image endswith \"\\\\cscript.exe\" and CommandLine matches regex \".* C:\\\\Users\\\\\\.*\\.jse .*\" or CommandLine matches regex \".* C:\\\\Users\\\\\\.*\\.vbe .*\" or CommandLine matches regex \".* C:\\\\Users\\\\\\.*\\.js .*\" or CommandLine matches regex \".* C:\\\\Users\\\\\\.*\\.vba .*\" or CommandLine matches regex \".* C:\\\\Users\\\\\\.*\\.vbs .*\" or CommandLine matches regex \".* C:\\\\ProgramData\\\\\\.*\\.jse .*\" or CommandLine matches regex \".* C:\\\\ProgramData\\\\\\.*\\.vbe .*\" or CommandLine matches regex \".* C:\\\\ProgramData\\\\\\.*\\.js .*\" or CommandLine matches regex \".* C:\\\\ProgramData\\\\\\.*\\.vba .*\" or CommandLine matches regex \".* C:\\\\ProgramData\\\\\\.*\\.vbs .*\") and not (ParentImage contains \"\\\\winzip\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_malware_wannacry",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_malware_wannacry.txt",
      "description": "KQL_win_malware_wannacry",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Image endswith \"\\\\tasksche.exe\" or Image endswith \"\\\\mssecsvc.exe\" or Image endswith \"\\\\taskdl.exe\" or Image contains \"\\\\@WanaDecryptor@\" or Image endswith \"\\\\taskhsvc.exe\" or Image endswith \"\\\\taskse.exe\" or Image endswith \"\\\\111.exe\" or Image endswith \"\\\\lhdfrgui.exe\" or Image endswith \"\\\\diskpart.exe\" or Image endswith \"\\\\linuxnew.exe\" or Image endswith \"\\\\wannacry.exe\" or CommandLine contains \"vssadmin delete shadows\" or CommandLine matches regex \".*icacls .* /grant Everyone:F /T /C /Q.*\" or CommandLine contains \"bcdedit /set {default} recoveryenabled no\" or CommandLine contains \"wbadmin delete catalog -quiet\" or CommandLine contains \"@Please_Read_Me@.txt\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mavinject_proc_inj",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mavinject_proc_inj.txt",
      "description": "KQL_win_mavinject_proc_inj",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \" /INJECTRUNNING \"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_mshta_spawn_shell",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_mshta_spawn_shell.txt",
      "description": "KQL_win_mshta_spawn_shell",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((ParentImage endswith \"\\\\mshta.exe\" and Image endswith \"\\\\cmd.exe\" or Image endswith \"\\\\powershell.exe\" or Image endswith \"\\\\wscript.exe\" or Image endswith \"\\\\cscript.exe\" or Image endswith \"\\\\sh.exe\" or Image endswith \"\\\\bash.exe\" or Image endswith \"\\\\reg.exe\" or Image endswith \"\\\\regsvr32.exe\" or Image contains \"\\\\BITSADMIN\") and not (CommandLine contains \"/HP/HP\" or CommandLine contains \"\\\\HP\\\\HP\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_net_ntlm_downgrade",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_net_ntlm_downgrade.txt",
      "description": "KQL_win_net_ntlm_downgrade",
      "query": "Event | where (EventID == \"13\" and TargetObject matches regex \".*SYSTEM\\\\\\.*ControlSet.*\\\\Control\\\\Lsa\\\\lmcompatibilitylevel\" or TargetObject matches regex \".*SYSTEM\\\\\\.*ControlSet.*\\\\Control\\\\Lsa\\\\NtlmMinClientSec\" or TargetObject matches regex \".*SYSTEM\\\\\\.*ControlSet.*\\\\Control\\\\Lsa\\\\RestrictSendingNTLMTraffic\") SecurityEvent | where (EventID == \"4657\" and ObjectName matches regex \"\\\\REGISTRY\\\\MACHINE\\\\SYSTEM\\\\\\.*ControlSet.*\\\\Control\\\\Lsa\" and ObjectValueName == \"LmCompatibilityLevel\" or ObjectValueName == \"NtlmMinClientSec\" or ObjectValueName == \"RestrictSendingNTLMTraffic\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_netsh_fw_add",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_netsh_fw_add.txt",
      "description": "KQL_win_netsh_fw_add",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"netsh firewall add\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_netsh_port_fwd_3389",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_netsh_port_fwd_3389.txt",
      "description": "KQL_win_netsh_port_fwd_3389",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine matches regex \"netsh i.* p.*=3389 c.*\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_netsh_port_fwd",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_netsh_port_fwd.txt",
      "description": "KQL_win_netsh_port_fwd",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine startswith \"netsh interface portproxy add v4tov4 \"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_office_shell",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_office_shell.txt",
      "description": "KQL_win_office_shell",
      "query": "SecurityEvent | where EventID == \"4688\" | where (ParentImage endswith \"\\\\WINWORD.EXE\" or ParentImage endswith \"\\\\EXCEL.EXE\" or ParentImage endswith \"\\\\POWERPNT.exe\" or ParentImage endswith \"\\\\MSPUB.exe\" or ParentImage endswith \"\\\\VISIO.exe\" or ParentImage endswith \"\\\\OUTLOOK.EXE\" and Image endswith \"\\\\cmd.exe\" or Image endswith \"\\\\powershell.exe\" or Image endswith \"\\\\wscript.exe\" or Image endswith \"\\\\cscript.exe\" or Image endswith \"\\\\sh.exe\" or Image endswith \"\\\\bash.exe\" or Image endswith \"\\\\scrcons.exe\" or Image endswith \"\\\\schtasks.exe\" or Image endswith \"\\\\regsvr32.exe\" or Image endswith \"\\\\hh.exe\" or Image endswith \"\\\\wmic.exe\" or Image endswith \"\\\\mshta.exe\" or Image endswith \"\\\\rundll32.exe\" or Image endswith \"\\\\msiexec.exe\" or Image endswith \"\\\\forfiles.exe\" or Image endswith \"\\\\scriptrunner.exe\" or Image endswith \"\\\\mftrace.exe\" or Image endswith \"\\\\AppVLP.exe\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_overpass_the_hash",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_overpass_the_hash.txt",
      "description": "KQL_win_overpass_the_hash",
      "query": "SecurityEvent | where (EventID == \"4624\" and LogonType == \"9\" and LogonProcessName == \"seclogo\" and AuthenticationPackageName == \"Negotiate\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_pass_the_hash",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_pass_the_hash.txt",
      "description": "KQL_win_pass_the_hash",
      "query": "SecurityEvent | where ((LogonType == \"3\" and LogonProcessName == \"NtLmSsp\" and WorkstationName == \"%Workstations%\" and ComputerName == \"%Workstations%\" and (EventID == \"4624\" or EventID == \"4625\")) and not (AccountName == \"ANONYMOUS LOGON\"))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_plugx_susp_exe_locations",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_plugx_susp_exe_locations.txt",
      "description": "KQL_win_plugx_susp_exe_locations",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((((((((((((Image endswith \"\\\\CamMute.exe\" and not (Image contains \"\\\\Lenovo\\\\Communication Utility\\\\\")) or (Image endswith \"\\\\chrome_frame_helper.exe\" and not (Image contains \"\\\\Google\\\\Chrome\\\\application\\\\\"))) or (Image endswith \"\\\\dvcemumanager.exe\" and not (Image contains \"\\\\Microsoft Device Emulator\\\\\"))) or (Image endswith \"\\\\Gadget.exe\" and not (Image contains \"\\\\Windows Media Player\\\\\"))) or (Image endswith \"\\\\hcc.exe\" and not (Image contains \"\\\\HTML Help Workshop\\\\\"))) or (Image endswith \"\\\\hkcmd.exe\" and not (Image contains \"\\\\System32\\\\\" or Image contains \"\\\\SysNative\\\\\" or Image contains \"\\\\SysWowo64\\\\\"))) or (Image endswith \"\\\\Mc.exe\" and not (Image contains \"\\\\Microsoft Visual Studio\" or Image contains \"\\\\Microsoft SDK\" or Image contains \"\\\\Windows Kit\"))) or (Image endswith \"\\\\MsMpEng.exe\" and not (Image contains \"\\\\Microsoft Security Client\\\\\" or Image contains \"\\\\Windows Defender\\\\\" or Image contains \"\\\\AntiMalware\\\\\"))) or (Image endswith \"\\\\msseces.exe\" and not (Image contains \"\\\\Microsoft Security Center\\\\\" or Image contains \"\\\\Microsoft Security Client\\\\\" or Image contains \"\\\\Microsoft Security Essentials\\\\\"))) or (Image endswith \"\\\\OInfoP11.exe\" and not (Image contains \"\\\\Common Files\\\\Microsoft Shared\\\\\"))) or (Image endswith \"\\\\OleView.exe\" and not (Image contains \"\\\\Microsoft Visual Studio\" or Image contains \"\\\\Microsoft SDK\" or Image contains \"\\\\Windows Kit\" or Image contains \"\\\\Windows Resource Kit\\\\\"))) or (Image endswith \"\\\\rc.exe\" and not (Image contains \"\\\\Microsoft Visual Studio\" or Image contains \"\\\\Microsoft SDK\" or Image contains \"\\\\Windows Kit\" or Image contains \"\\\\Windows Resource Kit\\\\\" or Image contains \"\\\\Microsoft.NET\\\\\")))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_possible_applocker_bypass",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_possible_applocker_bypass.txt",
      "description": "KQL_win_possible_applocker_bypass",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"\\\\msdt.exe\" or CommandLine contains \"\\\\installutil.exe\" or CommandLine contains \"\\\\regsvcs.exe\" or CommandLine contains \"\\\\regasm.exe\" or CommandLine contains \"\\\\regsvr32.exe\" or CommandLine contains \"\\\\msbuild.exe\" or CommandLine contains \"\\\\ieexec.exe\" or CommandLine contains \"\\\\mshta.exe\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_powershell_amsi_bypass",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_powershell_amsi_bypass.txt",
      "description": "KQL_win_powershell_amsi_bypass",
      "query": "SecurityEvent | where EventID == \"4688\" | where (CommandLine contains \"System.Management.Automation.AmsiUtils\" and CommandLine contains \"amsiInitFailed\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_powershell_b64_shellcode",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_powershell_b64_shellcode.txt",
      "description": "KQL_win_powershell_b64_shellcode",
      "query": "SecurityEvent | where EventID == \"4688\" | where (CommandLine contains \"AAAAYInlM\" and CommandLine contains \"OiCAAAAYInlM\" or CommandLine contains \"OiJAAAAYInlM\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_powershell_dll_execution",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_powershell_dll_execution.txt",
      "description": "KQL_win_powershell_dll_execution",
      "query": "SecurityEvent | where EventID == \"4688\" | where ((Image endswith \"\\\\rundll32.exe\" or Description contains \"Windows-Hostprozess (Rundll32)\") and CommandLine contains \"Default.GetString\" or CommandLine contains \"FromBase64String\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_powershell_download",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_powershell_download.txt",
      "description": "KQL_win_powershell_download",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Image endswith \"\\\\powershell.exe\" and CommandLine contains \"new-object system.net.webclient).downloadstring(\" or CommandLine contains \"new-object system.net.webclient).downloadfile(\" or CommandLine contains \"new-object net.webclient).downloadstring(\" or CommandLine contains \"new-object net.webclient).downloadfile(\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_powershell_renamed_ps",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_powershell_renamed_ps.txt",
      "description": "KQL_win_powershell_renamed_ps",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Description == \"Windows PowerShell\" and not ((Image endswith \"\\\\powershell.exe\" or Image endswith \"\\\\powershell_ise.exe\" or Description == \"Windows PowerShell ISE\")))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_powershell_suspicious_parameter_variation",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_powershell_suspicious_parameter_variation.txt",
      "description": "KQL_win_powershell_suspicious_parameter_variation",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Image endswith \"\\\\Powershell.exe\" and CommandLine == \" -windowstyle h \" or CommandLine == \" -windowstyl h\" or CommandLine == \" -windowsty h\" or CommandLine == \" -windowst h\" or CommandLine == \" -windows h\" or CommandLine == \" -windo h\" or CommandLine == \" -wind h\" or CommandLine == \" -win h\" or CommandLine == \" -wi h\" or CommandLine == \" -win h \" or CommandLine == \" -win hi \" or CommandLine == \" -win hid \" or CommandLine == \" -win hidd \" or CommandLine == \" -win hidde \" or CommandLine == \" -NoPr \" or CommandLine == \" -NoPro \" or CommandLine == \" -NoProf \" or CommandLine == \" -NoProfi \" or CommandLine == \" -NoProfil \" or CommandLine == \" -nonin \" or CommandLine == \" -nonint \" or CommandLine == \" -noninte \" or CommandLine == \" -noninter \" or CommandLine == \" -nonintera \" or CommandLine == \" -noninterac \" or CommandLine == \" -noninteract \" or CommandLine == \" -noninteracti \" or CommandLine == \" -noninteractiv \" or CommandLine == \" -ec \" or CommandLine == \" -encodedComman \" or CommandLine == \" -encodedComma \" or CommandLine == \" -encodedComm \" or CommandLine == \" -encodedCom \" or CommandLine == \" -encodedCo \" or CommandLine == \" -encodedC \" or CommandLine == \" -encoded \" or CommandLine == \" -encode \" or CommandLine == \" -encod \" or CommandLine == \" -enco \" or CommandLine == \" -en \")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_process_creation_bitsadmin_download",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_process_creation_bitsadmin_download.txt",
      "description": "KQL_win_process_creation_bitsadmin_download",
      "query": "SecurityEvent | where EventID == \"4688\" | where (Image endswith \"\\\\bitsadmin.exe\" and CommandLine == \"/transfer\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_psexesvc_start",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_psexesvc_start.txt",
      "description": "KQL_win_psexesvc_start",
      "query": "SecurityEvent | where EventID == \"4688\" | where ProcessCommandLine == \"C:\\Windows\\PSEXESVC.exe\"",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_rdp_bluekeep_poc_scanner",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_rdp_bluekeep_poc_scanner.txt",
      "description": "KQL_win_rdp_bluekeep_poc_scanner",
      "query": "// title: Scanner PoC for CVE-2019-0708 RDP RCE vuln // description: Detects the use of a scanner by zerosum0x0 that discovers targets vulnerable to  CVE-2019-0708 RDP RCE aka BlueKeep // // references: https://twitter.com/AdamTheAnalyst/status/1134394070045003776 & https://github.com/zerosum0x0/CVE-2019-0708 // // original authors: Florian Roth (sigma rule), Adam Bradbury (idea) // KQL author: Maarten Goet (Wortell) // // MITRE ATT&CK: lateral_movement, t1210   SecurityEvent  | where (EventID == \"4625\" and AccountName == \"AAAAAAA\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_rdp_localhost_login",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_rdp_localhost_login.txt",
      "description": "KQL_win_rdp_localhost_login",
      "query": "SecurityEvent | where (EventID == \"4624\" and LogonType == \"10\" and SourceNetworkAddress == \"::1\" or SourceNetworkAddress == \"127.0.0.1\")",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_rdp_reverse_tunnel",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_rdp_reverse_tunnel.txt",
      "description": "KQL_win_rdp_reverse_tunnel",
      "query": "SecurityEvent | where (EventID == \"5156\" and ((SourcePort == \"3389\" and DestinationAddress startswith \"127.\" or DestinationAddress == \"::1\") or (DestinationPort == \"3389\" and SourceAddress startswith \"127.\" or SourceAddress == \"::1\")))",
      "tactics": [
        "Collection"
      ]
    },
    {
      "author": "wortell",
      "displayName": "KQL_win_sdbinst_shim_persistence",
      "reference": "https://raw.githubusercontent.com/wortell/KQL/master/KQL_win_sdbinst_shim_persistence.txt",
      "description": "KQL_win_sdbinst_shim_persistence",
      "query": "